schnommus/stm32l0_scratch/new_code/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether 
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2017 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l0xx_hal.h"

#include <math.h>
#include <string.h>

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc;

I2C_HandleTypeDef hi2c1;

TSC_HandleTypeDef htsc;

UART_HandleTypeDef huart1;

TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC_Init(void);
static void MX_I2C1_Init(void);
static void MX_TSC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

#define RED_CHANNEL TIM_CHANNEL_2
#define GREEN_CHANNEL TIM_CHANNEL_3
#define BLUE_CHANNEL TIM_CHANNEL_4

// 'Channel' is one of the above options
// 'Value' is between 0-255
void set_led_brightness(uint32_t channel, uint8_t value) {
      TIM_OC_InitTypeDef sConfigOC;
      sConfigOC.OCMode = TIM_OCMODE_PWM1;
      sConfigOC.Pulse = value*4;
      sConfigOC.OCPolarity = TIM_OCPOLARITY_LOW; // Reverse polarity here so high values=bright
      sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
      HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, channel);
      HAL_TIM_PWM_Start(&htim2, channel);
}

#define TOUCH_SIZE_X 4
#define TOUCH_SIZE_Y 3

typedef struct _touch_pad {
    uint32_t channel_io;
    uint32_t sample_io;
    uint32_t sample_group;
    int32_t calibration_no_touch;
    int32_t calibration_touch;
} touch_pad_t;

touch_pad_t touch_matrix[TOUCH_SIZE_X + TOUCH_SIZE_Y] = {
    // X PADS
    {TSC_GROUP1_IO2, TSC_GROUP1_IO1, TSC_GROUP1_IDX, 265, 35}, // 2 diamonds closest to chip (x1)
    {TSC_GROUP1_IO3, TSC_GROUP1_IO1, TSC_GROUP1_IDX, 249, 37}, // (x2)
    {TSC_GROUP1_IO4, TSC_GROUP1_IO1, TSC_GROUP1_IDX, 265, 39}, // (x3)
    {TSC_GROUP2_IO2, TSC_GROUP2_IO1, TSC_GROUP2_IDX, 231, 45}, // 2 diamonds closest to end (x4)
    // Y PADS
    {TSC_GROUP2_IO3, TSC_GROUP2_IO1, TSC_GROUP2_IDX, 284, 45}, // Y, LED side (y1)
    {TSC_GROUP2_IO4, TSC_GROUP2_IO1, TSC_GROUP2_IDX, 226, 34}, // (y2)
    {TSC_GROUP4_IO2, TSC_GROUP4_IO1, TSC_GROUP4_IDX, 290, 47}, // Y, Switch side (y3)
};

#define SAMPLE_X 0
#define SAMPLE_Y 1

#define COMMAND_START       0xFD
#define COMMAND_KEYBOARD_TYPE 0x01
#define COMMAND_MOUSE_TYPE  0x02
#define COMMAND_CONSUMER_TYPE 0x03

// Index is 0 for first pad at that index
// Return in range 1 to 100
int sample_touch_at (int index, int what_to_sample) {

    if(what_to_sample == SAMPLE_X) {
        if(index >= TOUCH_SIZE_X) {
            printf("Trying to sample out-of-range X touch pad");
            return 0;
        }
    } else {
        if(index >= TOUCH_SIZE_Y) {
            printf("Trying to sample out-of-range Y touch pad");
            return 0;
        }
        index += 4;
    }


    TSC_IOConfigTypeDef touch_conf;
    touch_conf.ShieldIOs = 0;
    touch_conf.ChannelIOs = touch_matrix[index].channel_io;
    touch_conf.SamplingIOs = touch_matrix[index].sample_io;

    HAL_TSC_IOConfig(&htsc, &touch_conf);

    HAL_TSC_IODischarge(&htsc, ENABLE);

    HAL_Delay(1); // Wait for everything to discharge

    if(HAL_TSC_Start(&htsc) != HAL_OK) {
        printf("Error in HAL_TSC_Start");
    }

    while(HAL_TSC_GetState(&htsc) == HAL_TSC_STATE_BUSY) {
        // Wait for the reading to complete
    }

    __HAL_TSC_CLEAR_FLAG(&htsc, (TSC_FLAG_EOA | TSC_FLAG_MCE));

