schnommus/stm32l0_scratch/new_code/Src/main.c
    if( HAL_TSC_GroupGetStatus(&htsc, touch_matrix[index].sample_group)
            == TSC_GROUP_COMPLETED) {
        int v = HAL_TSC_GroupGetValue(&htsc, touch_matrix[index].sample_group);
        // Scale from 1 - 100
        v = touch_matrix[index].calibration_no_touch - v;
        int w = touch_matrix[index].calibration_no_touch - touch_matrix[index].calibration_touch;
        v = (100*v) / w;
        if( v > 100 ) v = 100;
        if( v < 1 ) v = 1;
        return v;
    }

    printf("Touch read didn't complete?\n");

    return -1;
}

// Takes an integer from 0 to 512 (should represent 000 to 5.12)
// Returns a value from 1 to 99 (1 corresponds to 0 degrees, 99 corresponds to 90 degrees)
// The output is scaled as that's what the interpolation needs
int fast_dodgy_atan(int x) {

    static const uint8_t atan_lut[512] =
        {1,1,2,3,4,4,5,6,6,7,8,9,9,10,11,11,12,13,14,14,15,16,16,17,18,18,19,20,20,21,22,22,
         23,24,24,25,25,26,27,27,28,29,29,30,30,31,32,32,33,33,34,34,35,36,36,37,37,38,38,39,
         39,40,40,41,41,42,42,43,43,44,44,45,45,46,46,47,47,48,48,49,49,49,50,50,51,51,52,52,
         52,53,53,54,54,54,55,55,55,56,56,56,57,57,58,58,58,59,59,59,60,60,60,61,61,61,62,62,
         62,62,63,63,63,64,64,64,64,65,65,65,66,66,66,66,67,67,67,67,68,68,68,68,69,69,69,69,
         70,70,70,70,70,71,71,71,71,72,72,72,72,72,73,73,73,73,73,74,74,74,74,74,75,75,75,75,
         75,75,76,76,76,76,76,77,77,77,77,77,77,78,78,78,78,78,78,78,79,79,79,79,79,79,80,80,
         80,80,80,80,80,80,81,81,81,81,81,81,81,82,82,82,82,82,82,82,82,83,83,83,83,83,83,83,
         83,83,84,84,84,84,84,84,84,84,84,85,85,85,85,85,85,85,85,85,86,86,86,86,86,86,86,86,
         86,86,86,87,87,87,87,87,87,87,87,87,87,87,88,88,88,88,88,88,88,88,88,88,88,88,89,89,
         89,89,89,89,89,89,89,89,89,89,89,90,90,90,90,90,90,90,90,90,90,90,90,90,90,91,91,91,
         91,91,91,91,91,91,91,91,91,91,91,91,92,92,92,92,92,92,92,92,92,92,92,92,92,92,92,92,
         92,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,94,94,94,94,94,94,94,94,94,
         94,94,94,94,94,94,94,94,94,94,94,94,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,
         95,95,95,95,95,95,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,
         96,96,96,96,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,
         97,97,97,97,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,
         98,98,98,98,98,98,98,98,98,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,
         99,99,99,99};

    if( x > 511 ) x = 511;
    if( x < 0 ) x = 0;

    return atan_lut[x];
}

typedef struct _interpolation_result {
    int position;
    int pressure;
} interpolation_result_t;

// Takes individual pressure values
// Translates into a position (from 0 to 100) and a touch pressure
// (Note the position may not be especially meaningful for low pressures!)
interpolation_result_t interpolate_touch_values_x(int *values) {
    int x_total = 0, y_total = 0;

    // Create a vector sum, such that final vector angle will
    // correspond to the interpolated position

    x_total += values[0]*100;
    // sin(0)=0
    x_total += values[1]*87;
    y_total += values[1]*50;
    x_total += values[2]*50;
    y_total += values[2]*87;
    y_total += values[3]*100;
    // cos(90)=0

    interpolation_result_t result;
    result.position = fast_dodgy_atan((100*y_total)/x_total);

    result.pressure = x_total*x_total + y_total*y_total;

    return result;
}

interpolation_result_t interpolate_touch_values_y(int *values) {
    int x_total = 0, y_total = 0;

    x_total += values[0]*100;
    // sin(0)=0
    x_total += values[1]*71;
    y_total += values[1]*71;
    y_total += values[2]*100;
    // cos(90)=0

    interpolation_result_t result;
    result.position = fast_dodgy_atan((100*y_total)/x_total);
    result.pressure = x_total*x_total + y_total*y_total;

    return result;
}

typedef struct _average_result {
    int x;
    int y;
} average_result_t;

#define N_AV 5

average_result_t average_deltas(int x_now, int y_now, int justPressed) {


    static int last_x = 0;
    static int last_y = 0;

    static int averages_x[N_AV];
    static int averages_y[N_AV];

    static int index_x = 0;
    static int index_y = 0;

    int8_t dx = x_now - last_x;
    int8_t dy = y_now - last_y;

    averages_x[index_x] = dx;
    averages_y[index_y] = dy;

    ++index_x;
    ++index_y;
    if(index_x >= N_AV) index_x = 0;
    if(index_y >= N_AV) index_y = 0;

    // Create a rolling average
    int sum_x = 0;
    int sum_y = 0;
    for(int i = 0; i != N_AV; ++i) {
        sum_x += averages_x[i];
        sum_y += averages_y[i];
    }

    // Quench instantaneous movement on a press
    if(justPressed) {
        for(int i = 0; i != N_AV; ++i) {
            averages_x[i] = 0;
            averages_y[i] = 0;
        }
        sum_x = sum_y = 0;
    }

    last_x = x_now;
    last_y = y_now;

    average_result_t result = {sum_x, sum_y};

    return result;
}

typedef struct _press_result {
    int just_pressed;
    int just_released;
    int just_tapped;
    int currently_pressed;
} press_result_t;

press_result_t track_presses(int current_pressure) {

    static int previously_pressed = 0;
    static int ticks_when_pressed = 0;

    press_result_t result = {0, 0, 0, 0};

    result.currently_pressed = current_pressure > 4000;

    if(previously_pressed == 0 && current_pressure > 4000) {
        result.just_pressed = 1;
        ticks_when_pressed = HAL_GetTick();
    }

    // Bit of hysteresis here
    if(previously_pressed == 1 && current_pressure < 2000) {
        result.just_released = 1;
    }

    if(result.just_released && HAL_GetTick() - ticks_when_pressed < 100) {
        result.just_tapped = 1;
    }

    previously_pressed = (current_pressure > 4000);

    return result;
}

#define MOUSE_BUTTON_LEFT   (uint8_t)1
#define MOUSE_BUTTON_RIGHT  (uint8_t)(1 << 1)

void issue_hid_mouse_command(int8_t x_move, int8_t y_move, int8_t scroll, uint8_t buttons) {

