schnommus/stm32l0_scratch/new_code/Src/main.c
    /*
     * BUTTONS = bitmask
     *  LSB = LEFT CLICK (LATCHES TO PRESSED)
     *  2nd to LSB = RIGHT CLICK (LATCHES TO PRESSED)
     * x_move is 8-bit 2-s complement relative movement
     * y_move is 8-bit 2-s complement relative movement
     * scroll is 8-bit 2-s complement relative movement
     */

    uint8_t hid_command[] = {
        COMMAND_START,
        5, // Rest of command length
        COMMAND_MOUSE_TYPE,
        (uint8_t) buttons,
        (uint8_t) x_move,
        (uint8_t) y_move,
        (uint8_t) scroll,
    };

    // Assumes total command length of 7
    HAL_UART_Transmit(&huart1, (uint8_t*)&hid_command, sizeof(hid_command), 100);
}

#define VOLUME_UP_LOW_BYTE 0x10
#define VOLUME_UP_HIGH_BYTE 0x00
#define VOLUME_DOWN_LOW_BYTE 0x20
#define VOLUME_DOWN_HIGH_BYTE 0x00
#define NEXT_LOW_BYTE 0x00
#define NEXT_HIGH_BYTE 0x01
#define PREV_LOW_BYTE 0x00
#define PREV_HIGH_BYTE 0x02
#define PLAY_PAUSE_LOW_BYTE 0x80
#define PLAY_PAUSE_HIGH_BYTE 0x00
#define RELEASE 0x00

void issue_hid_consumer_report(int8_t command_low_byte, int8_t command_high_byte) {

	uint8_t hid_command[] = {
		COMMAND_START,
		3, // Length of command
		COMMAND_CONSUMER_TYPE,
		(uint8_t) command_low_byte,
		(uint8_t) command_high_byte,
	};
	
	HAL_UART_Transmit(&huart1, (uint8_t*)&hid_command, sizeof(hid_command), 100);
		
}

/* Modifier applies shifts/ctrl etc

LSB - Left CTRL
Bit 1 - Left SHIFT
Bit 2 - Left ALT
Bit 3 - Left GUI
Bit 4 - Right CTRL
Bit 5 - Right SHIFT
Bit 6 - Right ALT
MSB -  Right GUI

NOTE: CURRENTLY ONLY SENDS ONE CHARACTER AT A TIME
*/ 

#define UP_ARROW_KEY 0x52
#define RIGHT_ARROW_KEY 0x4F
#define LEFT_ARROW_KEY 0x50
#define DOWN_ARROW_KEY 0x51
#define ENTER_KEY 0x28

void issue_hid_keyboard_command(int8_t modifier, int8_t keyboard_char) {
	
	uint8_t hid_command[] = {
		COMMAND_START,
		9, // Length of command
		COMMAND_KEYBOARD_TYPE,
		(uint8_t) modifier,
		0,
		(uint8_t) keyboard_char,
		0,
		0,
		0,	// Can add more characters here
		0,
		0,
	};
	
	HAL_UART_Transmit(&huart1, (uint8_t*)&hid_command, sizeof(hid_command), 100);
		
}

void move_and_tap_mouse(average_result_t deltas, press_result_t presses) {

    int mouse_dx = -deltas.y/2;
    int mouse_dy = -deltas.x/2;
    int buttons = 0;

    // Ignore the movement if it's probably bogus
    if(presses.just_pressed || !presses.currently_pressed) {
        mouse_dx = mouse_dy = 0;
    }

    if(presses.just_tapped) {
        buttons = MOUSE_BUTTON_LEFT;
    }

    issue_hid_mouse_command( mouse_dx, mouse_dy, 0, buttons);
}

void scroll_mouse(average_result_t deltas, press_result_t presses) {

    int scroll_delta = -deltas.x/15;

    // Ignore the movement if it's probably bogus
    if(presses.just_pressed || !presses.currently_pressed) {
        scroll_delta = 0;
    }

    issue_hid_mouse_command( 0, 0, scroll_delta, 0);
}

#define SKIP_THRESHOLD 2

int media_control(average_result_t deltas, press_result_t presses, int cooldown_curr) {

	int volume_control = deltas.x/15;
	int skip_control = -deltas.y/15;

	uint8_t command_low_byte = RELEASE;
	uint8_t command_high_byte = RELEASE;
	
	int cooldown_start = 0;
	
	// Ignore the movement if it's probably bogus
    if(presses.just_pressed || !presses.currently_pressed) {
        volume_control = 0;
        skip_control = 0;
    }
	
	// Control volume
	if(volume_control > 0) {
		command_low_byte = VOLUME_UP_LOW_BYTE;
		command_high_byte = VOLUME_UP_HIGH_BYTE;
	} else if(volume_control < 0) {
		command_low_byte = VOLUME_DOWN_LOW_BYTE;
		command_high_byte = VOLUME_DOWN_HIGH_BYTE;
	}
	
	// Control skips
	if(skip_control > SKIP_THRESHOLD && cooldown_curr == 0) {
		command_low_byte = NEXT_LOW_BYTE;
		command_high_byte = NEXT_HIGH_BYTE;
		cooldown_start = 1;
	} else if(skip_control < -1 * SKIP_THRESHOLD && cooldown_curr == 0) {
		command_low_byte = PREV_LOW_BYTE;
		command_high_byte = PREV_HIGH_BYTE;
		cooldown_start = 1;
	}
	
	// Control play/pause
	if(presses.just_tapped) {
		command_low_byte = PLAY_PAUSE_LOW_BYTE;
		command_high_byte = PLAY_PAUSE_HIGH_BYTE;
	}

	issue_hid_consumer_report(command_low_byte, command_high_byte);
	issue_hid_consumer_report(RELEASE, RELEASE);
	
	return cooldown_start;

}

void bt_send_cmd(char *s) {
    HAL_UART_Transmit(&huart1, (unsigned char*)s, strlen(s), 100);
    HAL_Delay(250);
}

void bt_send(char *s) {
    HAL_UART_Transmit(&huart1, (unsigned char*)s, strlen(s), 100);
}

void program_rn42_module() {
    printf("**PROGRAMMING RN-42 MODULE**\n");

    HAL_Delay(500);

    bt_send_cmd("$$$");
    bt_send_cmd("SF,1\r");
    bt_send_cmd("S-,SmartCutlery\r");
    bt_send_cmd("SN,SmartCutlery\r");
    bt_send_cmd("SS,Keyboard/Mouse\r");
    bt_send_cmd("SM,4\r");
    bt_send_cmd("S~,6\r");
    bt_send_cmd("SH,003C\r");
    bt_send_cmd("SY,0001\r");
    bt_send_cmd("SW,8000\r");
    bt_send_cmd("SI,0200\r");
    bt_send_cmd("SJ,0200\r");
    bt_send_cmd("R,1\r");

    printf("**FINISHED PROGRAMMING RN-42 MODULE**\n");
}

typedef struct _touch {
    int x;
    int y;
    int pressure;
    int ignore;
} touch_t;

// Any pad > this will contribute to the 'ignore' count
// Board dependent quantity:
// Sebastian's Version == 4
// Jamon's Version == 7

#define IGNORE_MIN_PRESSURE 7

// > N pads will force an ignore
#define IGNORE_PADS 6

touch_t sample_touch() {

    int x1 = sample_touch_at(0, SAMPLE_X);
    int x2 = sample_touch_at(1, SAMPLE_X);
    int x3 = sample_touch_at(2, SAMPLE_X);
    int x4 = sample_touch_at(3, SAMPLE_X);

    int y1 = sample_touch_at(0, SAMPLE_Y);
    int y2 = sample_touch_at(1, SAMPLE_Y);
    int y3 = sample_touch_at(2, SAMPLE_Y);

    int ignore_count =
        (x1 > IGNORE_MIN_PRESSURE) +
        (x2 > IGNORE_MIN_PRESSURE) +
        (x3 > IGNORE_MIN_PRESSURE) +
        (x4 > IGNORE_MIN_PRESSURE) +
        (y1 > IGNORE_MIN_PRESSURE) +
        (y2 > IGNORE_MIN_PRESSURE) +
        (y3 > IGNORE_MIN_PRESSURE);

