schnommus/stm32l0_scratch/new_code/Src/main.c
    if( ignore_count > IGNORE_PADS ) {
        touch_t result;
        result.x = 50;
        result.y = 50;
        result.pressure = 0;
        result.ignore = 1;
        return result;
    }

    int values_x[4] = {x1, x2, x3, x4};
    int values_y[3] = {y1, y2, y3};

    interpolation_result_t interp_x = interpolate_touch_values_x(values_x);
    interpolation_result_t interp_y = interpolate_touch_values_y(values_y);

    int pressure_final = (interp_x.pressure + interp_y.pressure)/10000;

    touch_t result;
    result.x = interp_x.position;
    result.y = interp_y.position;
    result.pressure = pressure_final;
    result.ignore = 0;

    return result;
}

void rgb_cycle() {
    set_led_brightness(RED_CHANNEL, 100);
    set_led_brightness(BLUE_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 0);
    HAL_Delay(50);
    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 100);
    set_led_brightness(GREEN_CHANNEL, 0);
    HAL_Delay(50);
    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 100);
    HAL_Delay(50);
    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 0);
}

#define PWROFF_PUSHTIME_MS 1000
#define PWROFF_INACTIVE_TIME_MS 60000
#define MODESWITCH_PUSHTIME_MS 100

#define COOLDOWN_LENGTH 200

typedef struct _timer {
    int start;
    int start_time;
    int enabled;
} timer;

enum modes {
    MODE_MOUSE = 0,
    MODE_SCROLL,
    MODE_MEDIA,
    // Insert extra modes here
    MODE_N
};

int main(void)
{

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_ADC_Init();
    MX_I2C1_Init();
    MX_TSC_Init();
    MX_USART1_UART_Init();
    MX_TIM2_Init();

    // Latch power on
    HAL_GPIO_WritePin(PWR_LATCH_GPIO_Port, PWR_LATCH_Pin, GPIO_PIN_SET);

    //program_rn42_module();

    // Cycle LEDs to show the world we are now alive
    for( int i = 0; i != 3; ++i ) {
        rgb_cycle();
    }

    printf("Starting main loop\n");

    rgb_cycle();

    // Boot time in systicks
    int tickStart = HAL_GetTick();
    int current_mode = MODE_MEDIA;
    int lastButtonUnpressedTicks = tickStart;
    int lastTouchTicks = tickStart;
    
    // Set up cooldown timer
    timer cooldown;
    cooldown.enabled = 0;
    cooldown.start_time = 0;

    while(1) {

        touch_t touch = sample_touch();

        printf("X=%03d Y=%03d P=%05d\n", touch.x, touch.y, touch.pressure);

        press_result_t presses = track_presses(touch.pressure);

        average_result_t deltas = average_deltas(touch.x, touch.y, presses.just_pressed);

        int target_brightness = touch.ignore ? 20 : 100;

        switch(current_mode) {
            case MODE_MOUSE:
                set_led_brightness(RED_CHANNEL, target_brightness);
                move_and_tap_mouse(deltas, presses);
            break;
            case MODE_SCROLL:
                set_led_brightness(GREEN_CHANNEL, target_brightness);
                scroll_mouse(deltas, presses);
            break;
            case MODE_MEDIA:
            	set_led_brightness(BLUE_CHANNEL, target_brightness);
            	cooldown.start = media_control(deltas, presses, cooldown.enabled);
            break;
        }
        
        // Manage cooldown - If started, set enable and start time
        // If enough time passed, disable
        if(cooldown.start) {
        	cooldown.enabled = 1;
        	cooldown.start = 0;
        	cooldown.start_time = HAL_GetTick();
        }
        
        if(cooldown.enabled == 1 && HAL_GetTick() - cooldown.start_time > COOLDOWN_LENGTH) {
        	cooldown.enabled = 0;
        	cooldown.start_time = 0;
        }  
        
        // If power button is held down for longer than specific time
        // turn the device off. If it is pressed for a short time, change modes.
        
        if(HAL_GPIO_ReadPin(PWR_BUTTON_GPIO_Port, PWR_BUTTON_Pin)) {
            if(HAL_GetTick() - lastButtonUnpressedTicks > PWROFF_PUSHTIME_MS) {
                break;
            }
        } else {
            if(HAL_GetTick() - lastButtonUnpressedTicks > MODESWITCH_PUSHTIME_MS) {
                ++current_mode;
                if(current_mode >= MODE_N) {
                    current_mode = 0;
                }
                rgb_cycle();
            }
            lastButtonUnpressedTicks = HAL_GetTick();
        }

        // Resting thumb or press keeps the thing alive
        if(touch.ignore || presses.currently_pressed) {
            lastTouchTicks = HAL_GetTick();
        }

        // If we haven't touched the device in a while,
        // power it off automatically
        if(HAL_GetTick() - lastTouchTicks >= PWROFF_INACTIVE_TIME_MS) {
            break;
        }

    }

    // Flash red to indicate shutting down

    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 0);

    set_led_brightness(RED_CHANNEL, 150);
    HAL_Delay(100);
    set_led_brightness(RED_CHANNEL, 0);
    HAL_Delay(100);
    set_led_brightness(RED_CHANNEL, 150);
    HAL_Delay(100);

    // Leave red LED on for possible fading effect

    HAL_GPIO_WritePin(PWR_LATCH_GPIO_Port, PWR_LATCH_Pin, GPIO_PIN_RESET);
    // Power is cut here ^
    HAL_Delay(1000);

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Configure the main internal regulator output voltage 
    */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

